cfe llm/Enums/AI_РежимВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_РежимВыполнения</Name>
			<Comment>Как обрабатывать несколько выбранных объектов: по объекту через очередь либо одним запросом к модели.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Очередь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОднимЗапросом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_МестаЗапускаСценариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_МестаЗапускаСценариев</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКоманды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйЗапрос</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНесколькоОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаИзвлечения</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_КартыИзвлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ВидДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_РежимВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Уточнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУточнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидУточнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредставления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСодержимого</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИмениФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередаватьСодержимое</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыКонтекста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидСравненияОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_ИнтерфейсныеСценарии/Ext/Module.bsl
// Формирует конфигурационно-независимый снимок контекста запуска.
// Прикладные ссылки используются только во время открытия формы и не сохраняются.
Функция СформироватьКонтекст(ОбъектыНазначения = Неопределено, ТипМеста = "Объект") Экспорт

	Объекты = НормализоватьОбъекты(ОбъектыНазначения);
	ЭлементыКонтекста = Новый Массив;
	ПолноеИмяМетаданных = "";
	ТипИсточника = "";
	КлючИсточника = "";
	ПредставлениеИсточника = "";

	Для Каждого ОбъектНазначения Из Объекты Цикл
		ЭлементКонтекста = ОписаниеОбъекта(ОбъектНазначения);
		ЭлементыКонтекста.Добавить(ЭлементКонтекста.JSON);
		Если Не ЗначениеЗаполнено(ПолноеИмяМетаданных) Тогда
			ПолноеИмяМетаданных = ЭлементКонтекста.ПолноеИмяМетаданных;
			ТипИсточника = ЭлементКонтекста.ТипИсточника;
			КлючИсточника = ЭлементКонтекста.Ключ;
			ПредставлениеИсточника = ЭлементКонтекста.Представление;
		ИначеЕсли ПолноеИмяМетаданных <> ЭлементКонтекста.ПолноеИмяМетаданных Тогда
			ПолноеИмяМетаданных = "";
		КонецЕсли;
	КонецЦикла;

	Если Объекты.Количество() = 0 Тогда
		ТипМеста = "Глобально";
		ПредставлениеИсточника = "Без прикладного объекта";
	ИначеЕсли Объекты.Количество() > 1 Тогда
		ПредставлениеИсточника = СтрШаблон("Выбрано объектов: %1", Объекты.Количество());
		КлючИсточника = "";
	КонецЕсли;

	JSONКонтекст = Новый Структура;
	JSONКонтекст.Вставить("version", 1);
	JSONКонтекст.Вставить("launch_place", ТипМеста);
	JSONКонтекст.Вставить("metadata_name", ПолноеИмяМетаданных);
	JSONКонтекст.Вставить("objects", ЭлементыКонтекста);

	Возврат Новый Структура(
		"ТипМеста,ПолноеИмяМетаданных,ТипИсточника,КлючИсточника,ПредставлениеИсточника,КонтекстJSON,ДанныеКонтекста,КоличествоОбъектов",
		ТипМеста,
		ПолноеИмяМетаданных,
		ТипИсточника,
		КлючИсточника,
		ПредставлениеИсточника,
		ЗаписатьJSONВСтроку(JSONКонтекст),
		СформироватьТекстКонтекста(ЭлементыКонтекста, ТипМеста),
		Объекты.Количество());

КонецФункции

// Разбирает агрегированный контекст на контексты отдельных объектов.
//
// Массовый режим делает по операции на объект, а ядро действий умеет работать
// только с одним: применить результат к «выбранным объектам» вообще нельзя —
// у каждого свой файл, свой ответ модели и свое решение человека.
//
// Разбор идет по снимку JSON, а не по ссылкам: ссылки в контексте не хранятся
// намеренно, и заводить для массового режима второй канал передачи данных
// значило бы обойти это правило.
Функция КонтекстыОбъектов(Знач Контекст) Экспорт

	Результат = Новый Массив;
	Если ТипЗнч(Контекст) <> Тип("Структура") Тогда
		Возврат Результат;
	КонецЕсли;

	ТекстJSON = "";
	Контекст.Свойство("КонтекстJSON", ТекстJSON);
	Если Не ЗначениеЗаполнено(ТекстJSON) Тогда
		Возврат Результат;
	КонецЕсли;

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Попытка
		Разобранное = ПрочитатьJSON(Чтение, Истина);
	Исключение
		// Контекст испорчен: молча вернуть пустой массив нельзя — вызывающий
		// решит, что объектов нет, и запустит пакет ни по чему.
		ВызватьИсключение "Не удалось разобрать контекст запуска: " + ОписаниеОшибки();
	КонецПопытки;

	Объекты = Неопределено;
	Если ТипЗнч(Разобранное) = Тип("Соответствие") Тогда
		Объекты = Разобранное.Получить("objects");
	КонецЕсли;
	Если ТипЗнч(Объекты) <> Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;

	ТипМеста = "Объект";
	Контекст.Свойство("ТипМеста", ТипМеста);

	Для Каждого Элемент Из Объекты Цикл
		Если ТипЗнч(Элемент) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		ПолноеИмя = Строка(?(Элемент.Получить("metadata_name") = Неопределено,
			"", Элемент.Получить("metadata_name")));
		Ключ = Строка(?(Элемент.Получить("key") = Неопределено,
			"", Элемент.Получить("key")));
		Представление = Строка(?(Элемент.Получить("presentation") = Неопределено,
			"", Элемент.Получить("presentation")));
		Если Не ЗначениеЗаполнено(Ключ) Тогда
			Продолжить;
		КонецЕсли;

		JSONОбъекта = Новый Структура("metadata_name,key,presentation",
			ПолноеИмя, Ключ, Представление);
		ЭлементыКонтекста = Новый Массив;
		ЭлементыКонтекста.Добавить(JSONОбъекта);

		JSONКонтекст = Новый Структура;
		JSONКонтекст.Вставить("version", 1);
		JSONКонтекст.Вставить("launch_place", ТипМеста);
		JSONКонтекст.Вставить("metadata_name", ПолноеИмя);
		JSONКонтекст.Вставить("objects", ЭлементыКонтекста);

		Результат.Добавить(Новый Структура(
			"ТипМеста,ПолноеИмяМетаданных,ТипИсточника,КлючИсточника,ПредставлениеИсточника,КонтекстJSON,ДанныеКонтекста,КоличествоОбъектов",
			ТипМеста,
			ПолноеИмя,
			ПолноеИмя,
			Ключ,
			Представление,
			ЗаписатьJSONВСтроку(JSONКонтекст),
			СформироватьТекстКонтекста(ЭлементыКонтекста, ТипМеста),
			1));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Проходит ли контекст отборы места запуска. Для пачки — хотя бы один объект.
Функция ОтборыПропускаютКонтекст(МестоЗапуска, Контекст)

	Если Контекст.КоличествоОбъектов <= 1 Тогда
		Возврат AI_ИзвлечениеРеквизитов.ПроверитьОтборыКонтекста(МестоЗапуска, Контекст);
	КонецЕсли;

	Для Каждого КонтекстОбъекта Из КонтекстыОбъектов(Контекст) Цикл
		Если AI_ИзвлечениеРеквизитов.ПроверитьОтборыКонтекста(МестоЗапуска, КонтекстОбъекта) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Режим выполнения места запуска для нескольких объектов.
//
// Пустое значение означает очередь: по операции на объект. Такой выбор по
// умолчанию сделан осознанно — один запрос по пачке объектов дает один ответ
// модели, который потом не к чему применить построчно.
Функция РежимВыполненияОчередью(МестоЗапуска) Экспорт

	Режим = МестоЗапуска.РежимВыполнения;
	Возврат Не Режим = Перечисления.AI_РежимВыполнения.ОднимЗапросом;

КонецФункции

// Возвращает только активные места запуска, доступные текущему пользователю.
Функция ПолучитьДоступныеСценарии(Контекст) Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("МестоЗапуска", Новый ОписаниеТипов("СправочникСсылка.AI_МестаЗапускаСценариев"));
	Результат.Колонки.Добавить("Сценарий", Новый ОписаниеТипов("СправочникСсылка.AI_Сценарии"));
	Результат.Колонки.Добавить("ПредставлениеКоманды", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НачальныйЗапрос", Новый ОписаниеТипов("Строка"));

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|  Места.Ссылка КАК МестоЗапуска,
		|  Места.Сценарий КАК Сценарий,
		|  Места.ПредставлениеКоманды КАК ПредставлениеКоманды,
		|  Места.Описание КАК Описание,
		|  Места.НачальныйЗапрос КАК НачальныйЗапрос,
		|  Места.РазрешитьНесколькоОбъектов КАК РазрешитьНесколькоОбъектов
		|ИЗ Справочник.AI_МестаЗапускаСценариев КАК Места
		|ГДЕ НЕ Места.ПометкаУдаления
		|  И Места.Активно
		|  И НЕ Места.Сценарий.ПометкаУдаления
		|  И Места.Сценарий.Активен
		|  И (Места.ТипМеста = &ТипМеста ИЛИ Места.ТипМеста = ""Глобально"")
		|  И (Места.ПолноеИмяМетаданных = """"
		|    ИЛИ Места.ПолноеИмяМетаданных = ""*""
		|    ИЛИ Места.ПолноеИмяМетаданных = &ПолноеИмяМетаданных)
		|УПОРЯДОЧИТЬ ПО Места.Порядок, Места.Наименование");
	Запрос.УстановитьПараметр("ТипМеста", Контекст.ТипМеста);
	Запрос.УстановитьПараметр("ПолноеИмяМетаданных", Контекст.ПолноеИмяМетаданных);
	ИдентификаторПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Контекст.КоличествоОбъектов > 1 И Не Выборка.РазрешитьНесколькоОбъектов Тогда
			Продолжить;
		КонецЕсли;
		РешениеОДоступе = AI_ДоступКАгентамСервер.ОпределитьДоступ(
			ИдентификаторПользователя,
			Выборка.Сценарий.Агент);
		Если Не РешениеОДоступе.Разрешен Тогда
			Продолжить;
		КонецЕсли;
		// Дополнительные отборы места запуска: позволяют разделить действия
		// внутри одного типа объекта — например, только документы вида «Договор».
		//
		// У пачки объекта в контексте нет: ключ источника пуст, и отбор по
		// реквизиту вычислить не на чем. Поэтому отбор проверяется по каждому
		// объекту, и действие предлагается, если подходит хотя бы один —
		// неподходящие отсеются при запуске, каждый со своей причиной.
		Если Не ОтборыПропускаютКонтекст(Выборка.МестоЗапуска, Контекст) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРезультата = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРезультата, Выборка);
		Если Не ЗначениеЗаполнено(СтрокаРезультата.ПредставлениеКоманды) Тогда
			СтрокаРезультата.ПредставлениеКоманды = Строка(СтрокаРезультата.Сценарий);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПодготовитьПараметрыДиалога(МестоЗапуска, Контекст, НачальныйЗапрос = "") Экспорт

	Если ТипЗнч(МестоЗапуска) <> Тип("СправочникСсылка.AI_МестаЗапускаСценариев")
		Или Не ЗначениеЗаполнено(МестоЗапуска)
		Или МестоЗапуска.ПометкаУдаления
		Или Не МестоЗапуска.Активно Тогда
		ВызватьИсключение "Место запуска сценария недоступно.";
	КонецЕсли;

	Сценарий = МестоЗапуска.Сценарий;
	Если Не ЗначениеЗаполнено(Сценарий) Или Сценарий.ПометкаУдаления Или Не Сценарий.Активен Тогда
		ВызватьИсключение "Сценарий недоступен для запуска.";
	КонецЕсли;
	РешениеОДоступе = AI_ДоступКАгентамСервер.ОпределитьДоступ(
		ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор,
		Сценарий.Агент);
	Если Не РешениеОДоступе.Разрешен Тогда
		ВызватьИсключение "Нет доступа к агенту сценария: " + РешениеОДоступе.Причина;
	КонецЕсли;

	// Правило множественного выбора проверяется здесь, а не только при отборе
	// действий: контекст приходит с клиента и доверять ему нельзя.
	КоличествоОбъектов = 0;
	Если ТипЗнч(Контекст) = Тип("Структура") Тогда
		Контекст.Свойство("КоличествоОбъектов", КоличествоОбъектов);
	КонецЕсли;
	Если КоличествоОбъектов > 1 И Не МестоЗапуска.РазрешитьНесколькоОбъектов Тогда
		ВызватьИсключение "Место запуска не допускает обработку нескольких объектов.";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(НачальныйЗапрос) Тогда
		НачальныйЗапрос = МестоЗапуска.НачальныйЗапрос;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сценарий", Сценарий);
	ПараметрыФормы.Вставить("НачальныйЗапрос", НачальныйЗапрос);
	ПараметрыФормы.Вставить("ДанныеКонтекста", Контекст.ДанныеКонтекста);
	ПараметрыФормы.Вставить("КонтекстJSON", Контекст.КонтекстJSON);
	ПараметрыФормы.Вставить("ВерсияКонтекста", 1);
	ПараметрыФормы.Вставить("ТипИсточника", Контекст.ТипИсточника);
	ПараметрыФормы.Вставить("КлючИсточника", Контекст.КлючИсточника);
	ПараметрыФормы.Вставить("ПредставлениеИсточника", Контекст.ПредставлениеИсточника);
	Возврат ПараметрыФормы;

КонецФункции

// Возвращает внешнюю обработку БСП, встроенную в подсистему макетом.
// Исходники лежат в integrations/bsp, но поставляется она вместе с расширением,
// чтобы не потеряться при переносе между базами.
Функция ПолучитьВстроеннуюОбработкуБСП() Экспорт

	Возврат Обработки.AI_ПомощникКонтекста.ПолучитьМакет("ОбработкаБСП");

КонецФункции

// Помещает встроенную обработку во временное хранилище и возвращает адрес.
// Подходит и для выгрузки в файл, и для передачи в форму регистрации
// дополнительной обработки БСП.
Функция АдресВстроеннойОбработкиБСП(ИдентификаторФормы = Неопределено) Экспорт

	Возврат ПоместитьВоВременноеХранилище(
		ПолучитьВстроеннуюОбработкуБСП(),
		ИдентификаторФормы);

КонецФункции

// Имя файла, под которым обработку ожидает увидеть администратор.
Функция ИмяФайлаВстроеннойОбработкиБСП() Экспорт

	Возврат "AI_ПомощникКонтекстаБСП.epf";

КонецФункции

Функция НормализоватьОбъекты(ОбъектыНазначения)
	Результат = Новый Массив;
	Если ОбъектыНазначения = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	Если ТипЗнч(ОбъектыНазначения) = Тип("Массив")
		Или ТипЗнч(ОбъектыНазначения) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Значение Из ОбъектыНазначения Цикл
			Если ЗначениеЗаполнено(Значение) Тогда
				Результат.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(ОбъектыНазначения) Тогда
		Результат.Добавить(ОбъектыНазначения);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ОписаниеОбъекта(ОбъектНазначения)
	ПолноеИмяМетаданных = "";
	Попытка
		ПолноеИмяМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ОбъектНазначения)).ПолноеИмя();
	Исключение
	КонецПопытки;
	ТипИсточника = ?(ЗначениеЗаполнено(ПолноеИмяМетаданных), ПолноеИмяМетаданных, Строка(ТипЗнч(ОбъектНазначения)));
	Ключ = "";
	Попытка
		Ключ = Строка(ОбъектНазначения.УникальныйИдентификатор());
	Исключение
		Попытка
			Ключ = XMLСтрока(ОбъектНазначения);
		Исключение
		КонецПопытки;
	КонецПопытки;
	Представление = Лев(Строка(ОбъектНазначения), 250);
	JSON = Новый Структура;
	JSON.Вставить("metadata_name", ПолноеИмяМетаданных);
	JSON.Вставить("key", Ключ);
	JSON.Вставить("presentation", Представление);
	Возврат Новый Структура(
		"ПолноеИмяМетаданных,ТипИсточника,Ключ,Представление,JSON",
		ПолноеИмяМетаданных,
		ТипИсточника,
		Ключ,
		Представление,
		JSON);
КонецФункции

Функция СформироватьТекстКонтекста(ЭлементыКонтекста, ТипМеста)
	Строки = Новый Массив;
	Строки.Добавить("Контекст запуска: " + ТипМеста);
	Для Каждого Элемент Из ЭлементыКонтекста Цикл
		Строки.Добавить(СтрШаблон(
			"Объект: %1; тип: %2; ключ: %3",
			Элемент.presentation,
			Элемент.metadata_name,
			Элемент.key));
	КонецЦикла;
	Возврат СтрСоединить(Строки, Символы.ПС);
КонецФункции

Функция ЗаписатьJSONВСтроку(Значение)
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Значение);
	Возврат Запись.Закрыть();
КонецФункции
